export enum Roles {
    admin = 'admin',
    student = 'student',
    responsible = 'responsible',
}

export const EventTypeOptions = [
    {
        title: 'культурно-творческая деятельность',
        value: 'культурно-творческая деятельность',
    },
    {
        title: 'научно-исследовательская',
        value: 'научно-исследовательская',
    },
    {
        title: 'общественная деятельность',
        value: 'общественная деятельность',
    },
    {
        title: 'спортивная деятельность',
        value: 'спортивная деятельность',
    },
];

export const EventStatuses = [
    {
        title: 'Вузовский',
        value: 'Вузовский',
    },
    {
        title: 'Городской',
        value: 'Городской',
    },
    {
        title: 'Областной',
        value: 'Областной',
    },
    {
        title: 'Всероссийский',
        value: 'Всероссийский',
    },
    {
        title: 'Международный',
        value: 'Международный',
    },
];

export const DirectionOptions = [
    {
        title: 'Информатика и вычислительная техника (09.03.01)',
        value: 'Информатика и вычислительная техника (09.03.01)',
    },
    {
        title: 'Информационные системы и технологии (09.03.02)',
        value: 'Информационные системы и технологии (09.03.02)',
    },
    {
        title: 'Информационная безопасность (10.03.01)',
        value: 'Информационная безопасность (10.03.01)',
    },
];

export const FacultiesOptions = [
    {
        title: 'Институт автоматики и информационных технологий (ИАИТ)',
        value: 'Институт автоматики и информационных технологий (ИАИТ)',
    },
];

export const GroupOptions = [
    {
        title: '02',
        value: '02',
    },
    {
        title: '12',
        value: '12',
    },
    {
        title: '04',
        value: '04',
    },
];

export const DepartamentOptions = [
    {
        title: 'Информационные технологии',
        value: 'Информационные технологии',
    },
    {
        title: 'Электронные системы и информационная безопасность',
        value: 'Электронные системы и информационная безопасность',
    },
];

export const CourseOptions = [
    {
        title: '1',
        value: '1',
    },
    {
        title: '2',
        value: '2',
    },
    {
        title: '3',
        value: '3',
    },
    {
        title: '4',
        value: '4',
    },
];
